In [1]:
import pandas as pd

In [2]:
name = ["Waqas","Azhar","ahmed Raza"]
hobbies = ["Coding","Reading","Writing"]
height = [5.6,5.4,5.3]

In [6]:
information = pd.DataFrame({'Name':name,'Hobbies':hobbies,'Height':height})
information

         Name  Hobbies  Height
0       Waqas   Coding     5.6
1       Azhar  Reading     5.4
2  ahmed Raza  Writing     5.3

In [7]:
information.set_index('Name', inplace=True)
information

            Hobbies  Height
Name
Waqas        Coding     5.6
Azhar       Reading     5.4
ahmed Raza  Writing     5.3

# When data is arranged in rows

In [9]:
row1 = ["waqas","Coding",5.6]
row2 = ["Azhar ahmed","Programming",5.6]
row3 = ["Ahmed Raza","Reading",5.6]

In [10]:
info = pd.DataFrame(data = [row1,row2,row3],columns = ['Name','Hobbies','Height'])

In [11]:
info

          Name      Hobbies  Height
0        waqas       Coding     5.6
1  Azhar ahmed  Programming     5.6
2   Ahmed Raza      Reading     5.6

In [19]:
df = pd.Series(data = hobbies, name="hobbies").to_frame()

In [23]:
df["Height"] = height
df

   hobbies  Height
0   Coding     5.6
1  Reading     5.4
2  Writing     5.3